zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K324_AXBS_LITE.h
#define AXBS_LITE_PRS3_M4_MASK                   (0x70000U)
#define AXBS_LITE_PRS3_M4_SHIFT                  (16U)
#define AXBS_LITE_PRS3_M4_WIDTH                  (3U)
#define AXBS_LITE_PRS3_M4(x)                     (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_PRS3_M4_SHIFT)) & AXBS_LITE_PRS3_M4_MASK)
/*! @} */

/*! @name CRS3 - Control Register */
/*! @{ */

#define AXBS_LITE_CRS3_PARK_MASK                 (0x7U)
#define AXBS_LITE_CRS3_PARK_SHIFT                (0U)
#define AXBS_LITE_CRS3_PARK_WIDTH                (3U)
#define AXBS_LITE_CRS3_PARK(x)                   (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS3_PARK_SHIFT)) & AXBS_LITE_CRS3_PARK_MASK)

#define AXBS_LITE_CRS3_PCTL_MASK                 (0x30U)
#define AXBS_LITE_CRS3_PCTL_SHIFT                (4U)
#define AXBS_LITE_CRS3_PCTL_WIDTH                (2U)
#define AXBS_LITE_CRS3_PCTL(x)                   (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS3_PCTL_SHIFT)) & AXBS_LITE_CRS3_PCTL_MASK)

#define AXBS_LITE_CRS3_ARB_MASK                  (0x300U)
#define AXBS_LITE_CRS3_ARB_SHIFT                 (8U)
#define AXBS_LITE_CRS3_ARB_WIDTH                 (2U)
#define AXBS_LITE_CRS3_ARB(x)                    (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS3_ARB_SHIFT)) & AXBS_LITE_CRS3_ARB_MASK)

#define AXBS_LITE_CRS3_HPE0_MASK                 (0x10000U)
#define AXBS_LITE_CRS3_HPE0_SHIFT                (16U)
#define AXBS_LITE_CRS3_HPE0_WIDTH                (1U)
#define AXBS_LITE_CRS3_HPE0(x)                   (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS3_HPE0_SHIFT)) & AXBS_LITE_CRS3_HPE0_MASK)

#define AXBS_LITE_CRS3_HPE1_MASK                 (0x20000U)
#define AXBS_LITE_CRS3_HPE1_SHIFT                (17U)
#define AXBS_LITE_CRS3_HPE1_WIDTH                (1U)
#define AXBS_LITE_CRS3_HPE1(x)                   (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS3_HPE1_SHIFT)) & AXBS_LITE_CRS3_HPE1_MASK)

#define AXBS_LITE_CRS3_HPE2_MASK                 (0x40000U)
#define AXBS_LITE_CRS3_HPE2_SHIFT                (18U)
#define AXBS_LITE_CRS3_HPE2_WIDTH                (1U)
#define AXBS_LITE_CRS3_HPE2(x)                   (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS3_HPE2_SHIFT)) & AXBS_LITE_CRS3_HPE2_MASK)

#define AXBS_LITE_CRS3_HPE3_MASK                 (0x80000U)
#define AXBS_LITE_CRS3_HPE3_SHIFT                (19U)
#define AXBS_LITE_CRS3_HPE3_WIDTH                (1U)
#define AXBS_LITE_CRS3_HPE3(x)                   (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS3_HPE3_SHIFT)) & AXBS_LITE_CRS3_HPE3_MASK)

#define AXBS_LITE_CRS3_HPE4_MASK                 (0x100000U)
#define AXBS_LITE_CRS3_HPE4_SHIFT                (20U)
#define AXBS_LITE_CRS3_HPE4_WIDTH                (1U)
#define AXBS_LITE_CRS3_HPE4(x)                   (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS3_HPE4_SHIFT)) & AXBS_LITE_CRS3_HPE4_MASK)

#define AXBS_LITE_CRS3_HLP_MASK                  (0x40000000U)
#define AXBS_LITE_CRS3_HLP_SHIFT                 (30U)
#define AXBS_LITE_CRS3_HLP_WIDTH                 (1U)
#define AXBS_LITE_CRS3_HLP(x)                    (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS3_HLP_SHIFT)) & AXBS_LITE_CRS3_HLP_MASK)

#define AXBS_LITE_CRS3_RO_MASK                   (0x80000000U)
#define AXBS_LITE_CRS3_RO_SHIFT                  (31U)
#define AXBS_LITE_CRS3_RO_WIDTH                  (1U)
#define AXBS_LITE_CRS3_RO(x)                     (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS3_RO_SHIFT)) & AXBS_LITE_CRS3_RO_MASK)
/*! @} */

/*! @name PRS4 - Priority Slave Registers */
/*! @{ */

#define AXBS_LITE_PRS4_M0_MASK                   (0x7U)
#define AXBS_LITE_PRS4_M0_SHIFT                  (0U)
#define AXBS_LITE_PRS4_M0_WIDTH                  (3U)
#define AXBS_LITE_PRS4_M0(x)                     (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_PRS4_M0_SHIFT)) & AXBS_LITE_PRS4_M0_MASK)

#define AXBS_LITE_PRS4_M1_MASK                   (0x70U)
#define AXBS_LITE_PRS4_M1_SHIFT                  (4U)
#define AXBS_LITE_PRS4_M1_WIDTH                  (3U)
#define AXBS_LITE_PRS4_M1(x)                     (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_PRS4_M1_SHIFT)) & AXBS_LITE_PRS4_M1_MASK)

#define AXBS_LITE_PRS4_M2_MASK                   (0x700U)
#define AXBS_LITE_PRS4_M2_SHIFT                  (8U)
#define AXBS_LITE_PRS4_M2_WIDTH                  (3U)
#define AXBS_LITE_PRS4_M2(x)                     (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_PRS4_M2_SHIFT)) & AXBS_LITE_PRS4_M2_MASK)

#define AXBS_LITE_PRS4_M3_MASK                   (0x7000U)
#define AXBS_LITE_PRS4_M3_SHIFT                  (12U)
#define AXBS_LITE_PRS4_M3_WIDTH                  (3U)
#define AXBS_LITE_PRS4_M3(x)                     (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_PRS4_M3_SHIFT)) & AXBS_LITE_PRS4_M3_MASK)

#define AXBS_LITE_PRS4_M4_MASK                   (0x70000U)
#define AXBS_LITE_PRS4_M4_SHIFT                  (16U)
#define AXBS_LITE_PRS4_M4_WIDTH                  (3U)
#define AXBS_LITE_PRS4_M4(x)                     (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_PRS4_M4_SHIFT)) & AXBS_LITE_PRS4_M4_MASK)
/*! @} */

/*! @name CRS4 - Control Register */
/*! @{ */

#define AXBS_LITE_CRS4_PARK_MASK                 (0x7U)
#define AXBS_LITE_CRS4_PARK_SHIFT                (0U)
#define AXBS_LITE_CRS4_PARK_WIDTH                (3U)
#define AXBS_LITE_CRS4_PARK(x)                   (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS4_PARK_SHIFT)) & AXBS_LITE_CRS4_PARK_MASK)

#define AXBS_LITE_CRS4_PCTL_MASK                 (0x30U)
#define AXBS_LITE_CRS4_PCTL_SHIFT                (4U)
#define AXBS_LITE_CRS4_PCTL_WIDTH                (2U)
#define AXBS_LITE_CRS4_PCTL(x)                   (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS4_PCTL_SHIFT)) & AXBS_LITE_CRS4_PCTL_MASK)

#define AXBS_LITE_CRS4_ARB_MASK                  (0x300U)
#define AXBS_LITE_CRS4_ARB_SHIFT                 (8U)
#define AXBS_LITE_CRS4_ARB_WIDTH                 (2U)
#define AXBS_LITE_CRS4_ARB(x)                    (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS4_ARB_SHIFT)) & AXBS_LITE_CRS4_ARB_MASK)

#define AXBS_LITE_CRS4_HPE0_MASK                 (0x10000U)
#define AXBS_LITE_CRS4_HPE0_SHIFT                (16U)
#define AXBS_LITE_CRS4_HPE0_WIDTH                (1U)
#define AXBS_LITE_CRS4_HPE0(x)                   (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS4_HPE0_SHIFT)) & AXBS_LITE_CRS4_HPE0_MASK)

#define AXBS_LITE_CRS4_HPE1_MASK                 (0x20000U)
#define AXBS_LITE_CRS4_HPE1_SHIFT                (17U)
#define AXBS_LITE_CRS4_HPE1_WIDTH                (1U)
#define AXBS_LITE_CRS4_HPE1(x)                   (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS4_HPE1_SHIFT)) & AXBS_LITE_CRS4_HPE1_MASK)

