zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K324_AXBS_LITE.h
#define AXBS_LITE_CRS4_HPE2_MASK                 (0x40000U)
#define AXBS_LITE_CRS4_HPE2_SHIFT                (18U)
#define AXBS_LITE_CRS4_HPE2_WIDTH                (1U)
#define AXBS_LITE_CRS4_HPE2(x)                   (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS4_HPE2_SHIFT)) & AXBS_LITE_CRS4_HPE2_MASK)

#define AXBS_LITE_CRS4_HPE3_MASK                 (0x80000U)
#define AXBS_LITE_CRS4_HPE3_SHIFT                (19U)
#define AXBS_LITE_CRS4_HPE3_WIDTH                (1U)
#define AXBS_LITE_CRS4_HPE3(x)                   (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS4_HPE3_SHIFT)) & AXBS_LITE_CRS4_HPE3_MASK)

#define AXBS_LITE_CRS4_HPE4_MASK                 (0x100000U)
#define AXBS_LITE_CRS4_HPE4_SHIFT                (20U)
#define AXBS_LITE_CRS4_HPE4_WIDTH                (1U)
#define AXBS_LITE_CRS4_HPE4(x)                   (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS4_HPE4_SHIFT)) & AXBS_LITE_CRS4_HPE4_MASK)

#define AXBS_LITE_CRS4_HLP_MASK                  (0x40000000U)
#define AXBS_LITE_CRS4_HLP_SHIFT                 (30U)
#define AXBS_LITE_CRS4_HLP_WIDTH                 (1U)
#define AXBS_LITE_CRS4_HLP(x)                    (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS4_HLP_SHIFT)) & AXBS_LITE_CRS4_HLP_MASK)

#define AXBS_LITE_CRS4_RO_MASK                   (0x80000000U)
#define AXBS_LITE_CRS4_RO_SHIFT                  (31U)
#define AXBS_LITE_CRS4_RO_WIDTH                  (1U)
#define AXBS_LITE_CRS4_RO(x)                     (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS4_RO_SHIFT)) & AXBS_LITE_CRS4_RO_MASK)
/*! @} */

/*! @name PRS5 - Priority Slave Registers */
/*! @{ */

#define AXBS_LITE_PRS5_M0_MASK                   (0x7U)
#define AXBS_LITE_PRS5_M0_SHIFT                  (0U)
#define AXBS_LITE_PRS5_M0_WIDTH                  (3U)
#define AXBS_LITE_PRS5_M0(x)                     (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_PRS5_M0_SHIFT)) & AXBS_LITE_PRS5_M0_MASK)

#define AXBS_LITE_PRS5_M1_MASK                   (0x70U)
#define AXBS_LITE_PRS5_M1_SHIFT                  (4U)
#define AXBS_LITE_PRS5_M1_WIDTH                  (3U)
#define AXBS_LITE_PRS5_M1(x)                     (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_PRS5_M1_SHIFT)) & AXBS_LITE_PRS5_M1_MASK)

#define AXBS_LITE_PRS5_M2_MASK                   (0x700U)
#define AXBS_LITE_PRS5_M2_SHIFT                  (8U)
#define AXBS_LITE_PRS5_M2_WIDTH                  (3U)
#define AXBS_LITE_PRS5_M2(x)                     (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_PRS5_M2_SHIFT)) & AXBS_LITE_PRS5_M2_MASK)

#define AXBS_LITE_PRS5_M3_MASK                   (0x7000U)
#define AXBS_LITE_PRS5_M3_SHIFT                  (12U)
#define AXBS_LITE_PRS5_M3_WIDTH                  (3U)
#define AXBS_LITE_PRS5_M3(x)                     (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_PRS5_M3_SHIFT)) & AXBS_LITE_PRS5_M3_MASK)

#define AXBS_LITE_PRS5_M4_MASK                   (0x70000U)
#define AXBS_LITE_PRS5_M4_SHIFT                  (16U)
#define AXBS_LITE_PRS5_M4_WIDTH                  (3U)
#define AXBS_LITE_PRS5_M4(x)                     (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_PRS5_M4_SHIFT)) & AXBS_LITE_PRS5_M4_MASK)
/*! @} */

/*! @name CRS5 - Control Register */
/*! @{ */

#define AXBS_LITE_CRS5_PARK_MASK                 (0x7U)
#define AXBS_LITE_CRS5_PARK_SHIFT                (0U)
#define AXBS_LITE_CRS5_PARK_WIDTH                (3U)
#define AXBS_LITE_CRS5_PARK(x)                   (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS5_PARK_SHIFT)) & AXBS_LITE_CRS5_PARK_MASK)

#define AXBS_LITE_CRS5_PCTL_MASK                 (0x30U)
#define AXBS_LITE_CRS5_PCTL_SHIFT                (4U)
#define AXBS_LITE_CRS5_PCTL_WIDTH                (2U)
#define AXBS_LITE_CRS5_PCTL(x)                   (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS5_PCTL_SHIFT)) & AXBS_LITE_CRS5_PCTL_MASK)

#define AXBS_LITE_CRS5_ARB_MASK                  (0x300U)
#define AXBS_LITE_CRS5_ARB_SHIFT                 (8U)
#define AXBS_LITE_CRS5_ARB_WIDTH                 (2U)
#define AXBS_LITE_CRS5_ARB(x)                    (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS5_ARB_SHIFT)) & AXBS_LITE_CRS5_ARB_MASK)

#define AXBS_LITE_CRS5_HPE0_MASK                 (0x10000U)
#define AXBS_LITE_CRS5_HPE0_SHIFT                (16U)
#define AXBS_LITE_CRS5_HPE0_WIDTH                (1U)
#define AXBS_LITE_CRS5_HPE0(x)                   (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS5_HPE0_SHIFT)) & AXBS_LITE_CRS5_HPE0_MASK)

#define AXBS_LITE_CRS5_HPE1_MASK                 (0x20000U)
#define AXBS_LITE_CRS5_HPE1_SHIFT                (17U)
#define AXBS_LITE_CRS5_HPE1_WIDTH                (1U)
#define AXBS_LITE_CRS5_HPE1(x)                   (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS5_HPE1_SHIFT)) & AXBS_LITE_CRS5_HPE1_MASK)

#define AXBS_LITE_CRS5_HPE2_MASK                 (0x40000U)
#define AXBS_LITE_CRS5_HPE2_SHIFT                (18U)
#define AXBS_LITE_CRS5_HPE2_WIDTH                (1U)
#define AXBS_LITE_CRS5_HPE2(x)                   (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS5_HPE2_SHIFT)) & AXBS_LITE_CRS5_HPE2_MASK)

#define AXBS_LITE_CRS5_HPE3_MASK                 (0x80000U)
#define AXBS_LITE_CRS5_HPE3_SHIFT                (19U)
#define AXBS_LITE_CRS5_HPE3_WIDTH                (1U)
#define AXBS_LITE_CRS5_HPE3(x)                   (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS5_HPE3_SHIFT)) & AXBS_LITE_CRS5_HPE3_MASK)

#define AXBS_LITE_CRS5_HPE4_MASK                 (0x100000U)
#define AXBS_LITE_CRS5_HPE4_SHIFT                (20U)
#define AXBS_LITE_CRS5_HPE4_WIDTH                (1U)
#define AXBS_LITE_CRS5_HPE4(x)                   (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS5_HPE4_SHIFT)) & AXBS_LITE_CRS5_HPE4_MASK)

#define AXBS_LITE_CRS5_HLP_MASK                  (0x40000000U)
#define AXBS_LITE_CRS5_HLP_SHIFT                 (30U)
#define AXBS_LITE_CRS5_HLP_WIDTH                 (1U)
#define AXBS_LITE_CRS5_HLP(x)                    (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS5_HLP_SHIFT)) & AXBS_LITE_CRS5_HLP_MASK)

#define AXBS_LITE_CRS5_RO_MASK                   (0x80000000U)
#define AXBS_LITE_CRS5_RO_SHIFT                  (31U)
#define AXBS_LITE_CRS5_RO_WIDTH                  (1U)
#define AXBS_LITE_CRS5_RO(x)                     (((uint32_t)(((uint32_t)(x)) << AXBS_LITE_CRS5_RO_SHIFT)) & AXBS_LITE_CRS5_RO_MASK)
/*! @} */

/*! @name PRS6 - Priority Slave Registers */
/*! @{ */

